//
//  PopUpSymbols.swift
//  Mext
//
//  Created by acai10 on 07.06.25.
//

// MARK: - PopUp Symbols
let popUpSymbolTitles: [String: [String]] = [
    // operator & comparison
    "+": ["±", "⊕", "⁺", "₊"],
    "−": ["∓", "–", "⁻", "₋"],
    "×": ["∘", "∙", "⨉", "*", "ˣ", "ₓ"],
    "∕": ["÷", "∶", "//", "%"],
    "=": ["≈", "≠", "≃", "∼", "≡", "≅", "≢", "≇"],
    "<": ["≪"],
    "≤": ["≦", "≲", "≨"],
    ">": ["≫"],
    "≥": ["≧", "≳", "≩"],
    "(": ["{", "[", "⁽", "₍"],
    ")": ["}", "]", "⁾", "₎"],
    ",": [";","'", "`", "⎵", "‖", "␣", "⎯"],

    // sets, roots, summation, integrals
    "∞": ["∝", "∞̅", "∞⁺", "∞₋"],
    "√": ["∛", "∜", "²", "³"],
    "∏": ["Π", "∐"],
    "Σ": ["∑", "σ"],
    "∫": ["∬", "∭", "∮"],
    "∈": ["∉", "∋", "∌"],
    "ℝ": ["ℕ", "ℕ₀", "ℤ", "ℤ⁺", "ℤ⁻", "ℚ", "ℝ", "ℝ⁺", "ℝ⁻", "ℂ", "𝔽"],
    "d": ["dx", "dy", "dz", "dr", "dϕ"],
    "∃": ["∃!"],

    // variables + superscript/subscript
    "x": ["X", "x̄", "x̂", "x̃", "ˣ", "ₓ"],
    "y": ["Y", "ȳ", "ŷ", "ʸ", "ᵧ"],
    "z": ["Z", "z̄", "ẑ", "ᶻ"],
    "a": ["A", "ā", "ₐ", "ᵃ"],
    "b": ["B", "𝒷", "ᵇ"],
    "c": ["C", "ĉ", "χ", "ᶜ"],
    "t": ["T", "t₀", "Δt", "ᵗ", "ₜ"],
    "n": ["N", "η", "ⁿ", "ₙ"],
    "v": ["V", "v̄", "𝑣", "ᵛ", "ᵥ","ϑ"],
    "r": ["R", "ʳ", "ᵣ"],
    "i": ["I", "ⁱ", "ᵢ"],
    "π": ["2π", "π⁻¹", "τ"],

    // digits + superscript/subscript
    "0": ["⁰", "₀", "Θ", "θ"],
    "1": ["¹", "⁻¹", "₁"],
    "2": ["²", "₂"],
    "3": ["³", "₃"],
    "4": ["⁴", "₄"],
    "5": ["⁵", "₅"],
    "6": ["⁶", "₆"],
    "7": ["⁷", "₇"],
    "8": ["⁸", "₈"],
    "9": ["⁹", "₉"],

    // greek alphabet
    "α": ["ᵅ", "ω", "Ω"],
    "β": ["b", "ᵝ", "ᵦ"],
    "γ": ["ɣ"],
    "δ": ["ᵟ"],
    "λ": ["Λ"],
    "μ": ["µ"],
    "σ": ["ς"],
    "Δ": ["∇"],

    // functions
    "∂": ["ϕ", "φ", "Φ", "ψ", "Ψ"],
    "→": ["⇀", "⟶"],
    "←": ["⟵"],
    "↔": ["⟷"],
    "⇔": ["⇌", "⮂", "⇆"],
    "⊢": ["⊣"],
    "⊨": ["⊭"],
    "∴": ["∵"],
    "⊆": ["⊂"],
    "⊇": ["⊃"],
    "e": ["eˣ" , "exp", "ln"],
    "ƒ": ["ƒ(x)", "ƒ'(x)", "ƒ''(x)", "ƒ⁻¹(x)"],
    "sin": ["sin²", "sin⁻¹"],
    "cos": ["cos²", "cos⁻¹"],
    "tan": ["tan²", "tan⁻¹"],
    
    // page switch
    "±×÷": ["±×÷", "αβγ", "ƒx"],
    "αβγ": ["±×÷", "αβγ", "ƒx"],
    "ƒx": ["±×÷", "αβγ", "ƒx"]
]

// MARK: - no-PopUp Buttons/Symbols
let noPopUp_symbols: [String] = [
    "space", "⌫", "⏎", "⇥"
]

// MARK: - page Switch Symbols
let pageSwitch_symbols: [String] = [
    "±×÷", "αβγ", "ƒx"
]

// MARK: - mainStack Symbols
let mainStack_fst_row: [String] = ["+", "−", "×", "∕", "=", "<", "≤", ">", "≥", "(", ")"]
let mainStack_snd_row: [String] = ["∞", "√", "∏", "Σ", "∫", "∈", "∃", "∀", "ℝ", ",", "d"]
let mainStack_trd_row: [String] = ["∅", "∪", "∩", "⊆", "⊇", "!"]

// MARK: - varStack Symbols
let varStack_fst_row: [String] = ["1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "n"]
let varStack_snd_row: [String] = ["x", "y", "z", "a", "b", "c", "t", "π", "r", "v", "i"]
let varStack_trd_row: [String] = ["α", "β", "γ", "δ", "λ", "μ"]

// MARK: - functionsStack Symbols
let functionStack_fst_row: [String] = ["sin", "cos", "tan", "log", "lim", "ƒ", "det"]
let functionStack_snd_row: [String] = ["∂", "Δ", "∇", "→", "←", "↔", "⇒", "⇐", "⇔", "⊥", "e"]
let functionStack_trd_row: [String] = ["∧", "∨", "¬", "⊢", "⊨", "∴"]
